/**
  *******************************************************************************************************
  * File Name: bsp_switch.c
  * Author: Vector
  * Version: V1.0.0
  * Date: 2018-3-2
  * Brief: 本文件提供了主控上拔码开关的基本操作函数
  *******************************************************************************************************
  * History
  *		1.Author: Vector
	*			Date: 2018-3-2
	*			Mod: 建立文件
  *
  *******************************************************************************************************
  */	
	

/*
  *******************************************************************************************************
  *                              INCLUDE FILES
  *******************************************************************************************************
*/

# include "bsp_switch.h"

/*
*********************************************************************************************************
*                     bsp_switch_Config                     
*
* Description: 初始化主控上的拔码开关
*             
* Arguments  : None.
*
* Reutrn     : None.
*
* Note(s)    : None.
*********************************************************************************************************
*/
void bsp_switch_Config(void)
{
	/*  初始化拔码开关引脚为输入  */
	gpio_init(BIT1_PIN, GPI,1);
	gpio_init(BIT2_PIN, GPI,1);
	gpio_init(BIT3_PIN, GPI,1);
	gpio_init(BIT4_PIN, GPI,1);
	
	/*  由于拔码开关关闭后为低电平,因此先开启上拉电阻  */
	port_pull(BIT1_PIN);
	port_pull(BIT2_PIN);
	port_pull(BIT3_PIN);
	port_pull(BIT4_PIN);
}


/*
*********************************************************************************************************
*                         bsp_switch_GetValue                 
*
* Description: 获取拔码开关的状态
*             
* Arguments  : None.
*
* Reutrn     : 1> 拔码开关的状态
*
* Note(s)    : None.
*********************************************************************************************************
*/
uint8_t bsp_switch_GetValue(void)
{
	uint8_t value = 0;
	
//	value |= (gpio_get(BIT1_PIN) == 1) ? (1 << 0 ) : (value);
//	value |= (gpio_get(BIT2_PIN) == 1) ? (1 << 1) : (value);
//	value |= (gpio_get(BIT3_PIN) == 1) ? (1 << 2) : (value);
//	value |= (gpio_get(BIT4_PIN) == 1) ? (1 << 3) : (value);
	value |= (uint8_t)((gpio_get(BIT1_PIN) << 0) | (gpio_get(BIT2_PIN) << 1));
	value |= (uint8_t)((gpio_get(BIT3_PIN) << 2) | (gpio_get(BIT4_PIN) << 3));
	
	return value;
}

/********************************************  END OF FILE  *******************************************/

