/**
  *******************************************************************************************************
  * File Name: bsp_encoder.c
  * Author: Vector
  * Version: V1.2.0
  * Date: 2018-2-28
  * Brief: 本文件提供了有关编码器的基本操作函数,如初始化、读取编码器值等,编码器采用中断方式计数
  *******************************************************************************************************
  * History	
  *		1.Author: Vector
	*			Date: 2018-2-28
	*     Mod: 建立文件
	*
	*		2.Author: Vector
	*			Date: 2018-3-2
	*			Mod: 1.将原本独立的编码器数据整合到Car结构体中,便于管理
	*
	*		3.Author: Vector
	*			Date: 2018-3-9
	*			Mod: 1.修复计数器出现溢出时速度计算出现很大负值BUG
  *
  *******************************************************************************************************
  */	

/*
  *******************************************************************************************************
  *                              INCLUDE FILES
  *******************************************************************************************************
*/

# include "bsp_encoder.h"
# include "FreescaleCar.h"
/*
*********************************************************************************************************
*                            bsp_encoder_Config              
*
* Description: 初始化编码器
*             
* Arguments  : None.
*
* Reutrn     : None.
*
* Note(s)    : None.
*********************************************************************************************************
*/
void bsp_encoder_Config(void)
{
	ftm_count_init(ftm0);
	ftm_count_init(ftm1);
	
	gpio_init(LEFTENCONDER_DIR_PIN, GPI, 1);
	gpio_init(RIGHTENCONDER_DIR_PIN, GPI, 1);
}

/*
*********************************************************************************************************
*                              bsp_encoder_SpeedCalc            
*
* Description: 由编码器的值计算电机速度
*             
* Arguments  : None.
*
* Reutrn     : None.
*
* Note(s)    : 该函数应该定时调用,以提高速度计算精度,同时该函数计算出来的值只能作为参考值,不是很精确
*********************************************************************************************************
*/
void bsp_encoder_ReadCounter(void)
{
	/*  读取电机编码器的值  */
	Car.Motor.LeftEncoder += ftm_count_get(ftm0);
	Car.Motor.RightEncoder += ftm_count_get(ftm1);
	
	ftm_count_clean(ftm0);
	ftm_count_clean(ftm1);
}

/********************************************  END OF FILE  *******************************************/


